Revit 2026 API

# UVNegate Method

---

Negates this 2-D vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV Negate()
```
```vb
Public Function Negate As UV
```
```cpp
public:
UV^ Negate()
```
```fsharp
member Negate : unit -> UV
```

#### Return Value

UVThe 2-D vector opposite to this vector.

The negated vector is obtained by changing the sign of each coordinate of this vector.

#### Reference

UV Class

Autodesk.Revit.DB Namespace